"""
import module_name1, ... module_nameN

Оператор import предназначен для импортирования модулей - других файлов.
После импортирования возможно использование любой функции, классов входящих в ее состав.

Особенности:
1. Импорт создает глобальную переменную с именем модуля, поэтому необходимо соблюдать правила именования переменных
2. Импортирование происходит один раз в коде, повторное применение оператора ничего не сделает, возможно принудительный
импорт.
3 При импорте происходит выполнение кода в ипортируемом файле

"""
